In [1]:
%load_ext sql

In [2]:
%sql sqlite:///chinook.db

In [16]:
%%sql
SELECT * FROM invoices 
LIMIT 5

 * sqlite:///chinook.db
Done.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94),
 (4, 14, '2009-01-06 00:00:00', '8210 111 ST NW', 'Edmonton', 'AB', 'Canada', 'T6G 2C7', 8.91),
 (5, 23, '2009-01-11 00:00:00', '69 Salem Street', 'Boston', 'MA', 'USA', '2113', 13.86)]

In [15]:
%%sql
SELECT BillingCountry, COUNT(BillingCountry) AS Count FROM invoices
GROUP BY BillingCountry
ORDER BY COUNT(BillingCountry) DESC

 * sqlite:///chinook.db
Done.

[('USA', 91),
 ('Canada', 56),
 ('France', 35),
 ('Brazil', 35),
 ('Germany', 28),
 ('United Kingdom', 21),
 ('Portugal', 14),
 ('Czech Republic', 14),
 ('India', 13),
 ('Sweden', 7),
 ('Spain', 7),
 ('Poland', 7),
 ('Norway', 7),
 ('Netherlands', 7),
 ('Italy', 7),
 ('Ireland', 7),
 ('Hungary', 7),
 ('Finland', 7),
 ('Denmark', 7),
 ('Chile', 7),
 ('Belgium', 7),
 ('Austria', 7),
 ('Australia', 7),
 ('Argentina', 7)]